[

    {
        "title":"ความรู้นอกห้องเรียน คือ",
        "subtitle":"สิ่งที่ควรไว้มากกว่าความรู้ในห้องเรียน",
        "image_url":"https://raw.githubusercontent.com/Plan-ner/Flutter/main/Computer.jpg,
        "detail":"วัยเด็ก คือ วัยแห่งการเรียนรู้ ซึ่งแหล่งเรียนรู้หลัก ๆ คงไม่พ้นโรงเรียน แต่รู้หรือไม่ว่า ปัจจุบันการเรียนรู้ไม่ได้จำกัดอยู่แต่ในห้องเรียนเท่านั้น การทำกิจกรรมต่าง ๆ นอกห้องเรียน ก็เป็นการช่วยเสริมทักษะและประสบการณ์ใหม่ ๆ ที่ไม่มีในห้องเรียน ไม่ว่าจะเป็นการทำอาหารง่าย ๆ การฝึกเล่นดนตรี หรือทำงานศิลปะ เป็นต้น และวันนี้เราจะพาไปดูกันว่า การเรียนรู้นอกห้องเรียน มีความสำคัญ และมีประโยชน์ต่อเด็ก ๆ อย่างไรบ้าง ? ตามไปดูกัน\n\nต้องยอมรับว่า การเรียนของเด็กสมัยนี้ มีการแข่งขันสูงมากตั้งแต่เด็ก ไม่แปลกที่จะทำให้เกิดความเครียด ความกดดันได้ง่าย ซึ่งถือว่าเป็นเรื่องที่ไม่ดีอย่างมาก ฉะนั้น การหากิจกรรมนอกห้องเรียนที่มีประโยชน์และทำให้รู้สึกผ่อนคลาย สบายใจมากยิ่งขึ้น"

    },
    {
        "title":"What is UX & UI DESIGN",
        "subtitle":"มาลองออกแบบ Application ที่เราใช้กันอยู่สุดวันนี้กันเถอะ",
        "image_url":"https://raw.githubusercontent.com/Plan-ner/Flutter/main/Design.jpg",
        "detail":"ในระดับพื้นฐาน User Interface (UI) คือชุดของหน้าจอ หน้าเว็บ และองค์ประกอบแบบรูปภาพต่างๆ เช่น ปุ่มและไอคอน ซึ่งจะช่วยให้บุคคลสามารถโต้ตอบกับผลิตภัณฑ์หรือบริการได้\n\nตรงกันข้ามกับ User experience (UX) ที่เป็นประสบการณ์ภายในที่บุคคลหนึ่งมีส่วนร่วมในทุกๆด้านของผลิตภัณฑ์และบริการของบริษัท\n\nเป็นเรื่องปกติที่คนเราจะใช้คำเหล่านี้แทนกันหรือบางครั้งก็ไม่ถูกต้อง ถ้าคุณเคยสงสัยว่า UI คืออะไร UX คืออะไร และอะไรคือความแตกต่างระหว่างสองสิ่งนี้ ในโพสต์วันนี้เราจะเจาะลึกเข้าไปใน UI และ UX เพื่อทำความเข้าใจเกี่ยวกับความแตกต่างระหว่างกันมากขึ้น"
        
    },
    {
        "title":"What is Basic Coding...",
        "subtitle":"มาลองเรียนรู้พื้นฐานของการ Coding กันเถอะ",
        "image_url":"https://raw.githubusercontent.com/Plan-ner/Flutter/main/Program.jpg",
        "detail":"ภาษาโปรแกรมแต่ละภาษาจะมีลักษณะหรือรูปแบบการเขียนที่แตกต่างกัน การเลือกภาษาโปรแกรมหรือภาษาคอมพิวเตอร์เพื่อนำมาเขียนโปรแกรมนั้นขึ้นอยู่กับปัจจัยหลาย ๆ อย่าง เช่นนโยบายของบริษัท, ความเหมาะสมของโปรแกรมกับลักษณะงานที่จะถูกนำไปใช้, การเข้ากันได้กับโปรแกรมอื่น ๆ, หรืออาจเป็นความถนัดของแต่ละคน ภาษาโปรแกรมที่มีแนวโน้มในการนำมาเขียนมักเป็นภาษาที่มีคนที่สามารถเขียนได้ทันที หรือหากมีความจำเป็นที่จะต้องเลือกใช้ภาษาอื่น เช่นต้องการเน้นประสิทธิภาพในการทำงานของโปรแกรม ก็อาจจำเป็นต้องหานักเขียนโปรแกรมขึ้นมาจำนวนหนึ่งซึ่งมีความรู้ความเข้าใจในภาษาโปรแกรมที่ต้องการ และองมีคอมไพเลอร์ที่รองรับภาษาเหล่านั้นด้วย"
        
    }

]
